
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 10 to change, 8 to destroy.</code></pre>

* Update
  * azurerm_api_management_subscription.product[0]
  * azurerm_automation_account.automation_account
  * module.apim_product[0].azurerm_api_management_product.product
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects_trigger_once
  * module.kv.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_apim.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_sdp.azurerm_monitor_diagnostic_setting.kv-ds
  * module.redis.azurerm_redis_cache.redis
  * module.sa.azurerm_storage_account.storage_account
* Replace
  * azurerm_key_vault_access_policy.app_mi_access_policy
  * azurerm_storage_blob.b2c_policy_files[&#34;admin-mfa.css&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;login.css&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;login.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;reset-pw.css&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;reset-pw.html&#34;]
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_job_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_job_schedule.client_serects_trigger_once


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_user_assigned_identity.apim_mi will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "apim_mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "pip-apim-stg-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-stg-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # data.azurerm_user_assigned_identity.app_mi will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "app_mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "pip-stg-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-stg-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azurerm_api_management_subscription.product[0] will be updated in-place
  ~ resource "azurerm_api_management_subscription" "product" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/d5a0ba59-f5ac-4e05-9650-2e5734c17e29"
        # (8 unchanged attributes hidden)
    }

  # azurerm_automation_account.automation_account will be updated in-place
  ~ resource "azurerm_automation_account" "automation_account" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa"
        name                          = "pip-ss-stg-aa"
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (10 unchanged attributes hidden)

      ~ identity {
          ~ identity_ids = [
              - "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/managed-identities-ptl-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/jenkins-ptl-mi",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-apim-stg-mi",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-stg-mi",
            ] -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_access_policy.app_mi_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "app_mi_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-apim-kv-stg/objectId/6a64b0e0-13eb-4f0c-b9a9-f88ae1928fed" -> (known after apply)
      ~ object_id               = "6a64b0e0-13eb-4f0c-b9a9-f88ae1928fed" -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_files["admin-mfa.css"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_files" {
      ~ access_tier            = "Cool" -> (known after apply)
      - content_md5            = "54862dfdd4b042f68e444cd1ceb43b31" -> null # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/admin-mfa.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "admin-mfa.css"
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/admin-mfa.css" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_files["login.css"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_files" {
      ~ access_tier            = "Cool" -> (known after apply)
      - content_md5            = "6f2c138f1b48c5adfed9336f2350f3f9" -> null # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/login.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "login.css"
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/login.css" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_files["login.html"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_files" {
      ~ access_tier            = "Cool" -> (known after apply)
      - content_md5            = "bb00fbb45c98c122b94a02541015ac68" -> null # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/login.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "login.html"
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/login.html" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_files["reset-pw.css"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_files" {
      ~ access_tier            = "Cool" -> (known after apply)
      - content_md5            = "7e82fba6b2718b3c7928f6f8bebcdd14" -> null # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "reset-pw.css"
      ~ source_content         = <<-EOT # forces replacement
            @charset "UTF-8";
            .govspeak p {
              color: #0b0c0c;
              -moz-osx-font-smoothing: grayscale;
              font-weight: 400;
              font-family: "GDS Transport", arial, sans-serif;
              font-size: 19px;
              line-height: 1.3157894737;
              margin-top: 20px;
              margin-bottom: 20px;
            }
            
            .govspeak ul {
              list-style-position: outside;
              list-style-type: disc;
            }
            
            .govspeak li {
              margin: 0 0 5px;
              padding: 0;
              font-size: 19px;
              font-family: "GDS Transport", arial, sans-serif;
              -moz-osx-font-smoothing: grayscale;
              font-weight: 400;
              color: #0b0c0c;
            }
            
            .gem-c-document-list__item {
              color: #0b0c0c;
              font-family: "GDS Transport", arial, sans-serif;
              -moz-osx-font-smoothing: grayscale;
              font-weight: 400;
              font-size: 19px;
              line-height: 1.3157894737;
              margin-bottom: 25px;
              padding-top: 10px;
              border-top: 1px solid #b1b4b6;
              list-style: none;
            }
            
            .gem-c-contents-list__list-item--dashed {
              position: relative;
              padding-left: 25px;
              padding-right: 25px;
              padding-top: 7.5px;
              line-height: 1.3;
              list-style-type: none;
              font-size: 16px;
              color: #0b0c0c;
              font-family: "GDS Transport", arial, sans-serif;
              -moz-osx-font-smoothing: grayscale;
              font-weight: 400;
            }
            
            .gem-c-contents-list__list-item--dashed::before {
              content: "—";
              position: absolute;
              left: 0;
              width: 20px;
              overflow: hidden;
            }
            
            .gem-c-contents-list__title {
              font-size: 16px;
              line-height: 1.5;
              color: #0b0c0c;
              font-family: "GDS Transport", arial, sans-serif;
              -moz-osx-font-smoothing: grayscale;
              font-weight: 400;
            }
            
            .gem-c-lead-paragraph {
              color: #0b0c0c;
              font-family: "GDS Transport", arial, sans-serif;
              margin-top: 0;
              -moz-osx-font-smoothing: grayscale;
              font-size: 24px;
              line-height: 1.25;
              margin-bottom: 40px;
              max-width: 30em;
            }
            
            .metadata-logo-wrapper {
              border-top: 1px solid #b1b4b6;
              margin-left: 15px;
              margin-right: 15px;
              content: "";
              clear: both;
              display: block;
              box-sizing: border-box;
              width: 100%;
            }
            
            .govuk-grid-column-two-thirds {
              width: 66.6666%;
              float: left;
            }
            
            .gem-c-metadata {
              margin-right: -15px;
              margin-left: -15px;
              margin-bottom: 40px;
              line-height: 1.25;
              font-family: "GDS Transport", arial, sans-serif;
              font-size: 16px;
              font-weight: 400;
              color: #0b0c0c;
              -moz-osx-font-smoothing: grayscale;
              float: left;
              width: 66.66%;
            }
            
            .group-title {
              margin-top: 50px;
              margin-bottom: 20px;
              font-size: 27px;
              line-height: 1.1111111;
              font-weight: 700;
              font-family: "GDS Transport", arial, sans-serif;
              -moz-osx-font-smoothing: grayscale;
            }
            
            .app-c-published-dates {
              padding-top: 10px;
              border-top: 1px solid #b1b4b6;
              direction: ltr;
              line-height: 1.45em;
              color: #0b0c0c;
            }
            
            .gem-c-related-navigation__sub-heading {
              font-size: 19px;
              line-height: 1.3157894737;
              font-family: "GDS Transport", arial, sans-serif;
              border-top: 0;
              padding-top: 0;
              margin-top: 15px;
              margin-bottom: 10px;
              color: #0b0c0c;
              font-weight: 700;
            }
            
            .gem-c-related-navigation__link {
              line-height: 1.28;
              font-size: 16px;
              font-family: "GDS Transport", arial, sans-serif;
              font-weight: 400;
              margin-top: 15px;
            }
            
            .gem-c-related-navigation {
              border-top: 2px solid #1d70b8;
              color: #0b0c0c;
              font-family: "GDS Transport", arial, sans-serif;
              text-decoration-skip-ink: none;
            }
            
            .gem-c-related-navigation__link-list {
              font-family: "GDS Transport", arial, sans-serif;
              color: #003078;
              margin-bottom: 1.25em;
              font-weight: bold;
              font-size: 16px;
              list-style-type: none;
              text-decoration: underline;
              text-underline-offset: .1em;
            }
            
            .gem-c-related-navigation__main-heading {
              font-size: 19px;
              font-family: "GDS Transport", arial, sans-serif;
              line-height: 1.31578;
              -moz-osx-font-smoothing: grayscale;
              margin-top: 15px;
              margin-bottom: 10px;
              color: #0b0c0c;
            }
            
            @charset "UTF-8";
            .govuk-link {
              font-family: "GDS Transport", arial, sans-serif;
              -webkit-font-smoothing: antialiased;
              -moz-osx-font-smoothing: grayscale;
              text-decoration: underline;
            }
            
            /*! Copyright (c) 2011 by Margaret Calvert & Henrik Kubel. All rights reserved. The font has been customised for exclusive use on gov.uk. This cut is not commercially available. */
            /* stylelint-disable-line scss/comment-no-loud  */
            @font-face {
              font-family: "GDS Transport";
              font-style: normal;
              font-weight: normal;
              font-display: fallback;
            }
            
            @font-face {
              font-family: "GDS Transport";
              font-style: normal;
              font-weight: bold;
              font-display: fallback;
            }
            
            @media print {
              .govuk-link {
                font-family: sans-serif;
              }
            }
            
            .govuk-link:focus {
              outline: 3px solid transparent;
              color: #0b0c0c;
              background-color: #ffdd00;
              box-shadow: 0 -2px #ffdd00, 0 4px #0b0c0c;
              text-decoration: none;
            }
            
            .govuk-link:link {
              color: #1d70b8;
            }
            
            .govuk-link:visited {
              color: #4c2c92;
            }
            
            .govuk-link:hover {
              color: #003078;
            }
            
            .govuk-link:active {
              color: #0b0c0c;
            }
            
            .govuk-link:focus {
              color: #0b0c0c;
            }
            
            @media print {
              .govuk-link[href^="/"]:after, .govuk-link[href^="http://"]:after, .govuk-link[href^="https://"]:after {
                content: " (" attr(href) ")";
                font-size: 90%;
                word-wrap: break-word;
              }
            }
            
            .govuk-link--muted:link, .govuk-link--muted:visited {
              color: #505a5f;
            }
            
            .govuk-link--muted:hover, .govuk-link--muted:active {
              color: #0b0c0c;
            }
            
            .govuk-link--muted:focus {
              color: #0b0c0c;
            }
            
            .govuk-link--text-colour:link, .govuk-link--text-colour:visited {
              color: #0b0c0c;
            }
            
            @media print {
              .govuk-link--text-colour:link, .govuk-link--text-colour:visited {
                color: #000000;
              }
            }
            
            .govuk-link--text-colour:hover {
              color: rgba(11, 12, 12, 0.99);
            }
            
            .govuk-link--text-colour:active, .govuk-link--text-colour:focus {
              color: #0b0c0c;
            }
            
            @media print {
              .govuk-link--text-colour:active, .govuk-link--text-colour:focus {
                color: #000000;
              }
            }
            
            .govuk-link--inverse:link, .govuk-link--inverse:visited {
              color: #ffffff;
            }
            
            .govuk-link--inverse:hover, .govuk-link--inverse:active {
              color: rgba(255, 255, 255, 0.99);
            }
            
            .govuk-link--inverse:focus {
              color: #0b0c0c;
            }
            
            .govuk-link--no-underline:not(:hover):not(:active) {
              text-decoration: none;
            }
            
            .govuk-link--no-visited-state:link {
              color: #1d70b8;
            }
            
            .govuk-link--no-visited-state:visited {
              color: #1d70b8;
            }
            
            .govuk-link--no-visited-state:hover {
              color: #003078;
            }
            
            .govuk-link--no-visited-state:active {
              color: #0b0c0c;
            }
            
            .govuk-link--no-visited-state:focus {
              color: #0b0c0c;
            }
            
            .govuk-list {
              font-family: "GDS Transport", arial, sans-serif;
              -webkit-font-smoothing: antialiased;
              -moz-osx-font-smoothing: grayscale;
              font-weight: 400;
              font-size: 16px;
              font-size: 1rem;
              line-height: 1.25;
              color: #0b0c0c;
              margin-top: 0;
              margin-bottom: 15px;
              padding-left: 0;
              list-style-type: none;
            }
            
            @media print {
              .govuk-list {
                font-family: sans-serif;
              }
            }
            
            @media (min-width: 40.0625em) {
              .govuk-list {
                font-size: 19px;
                font-size: 1.1875rem;
                line-height: 1.31579;
              }
            }
            
            @media print {
              .govuk-list {
                font-size: 14pt;
                line-height: 1.15;
              }
            }
            
            @media print {
              .govuk-list {
                color: #000000;
              }
            }
            
            @media (min-width: 40.0625em) {
              .govuk-list {
                margin-bottom: 20px;
              }
            }
            
            .govuk-list .govuk-list {
              margin-top: 10px;
            }
            
            .govuk-list > li {
              margin-bottom: 5px;
            }
            
            .govuk-list--bullet {
              padding-left: 20px;
              list-style-type: disc;
            }
            
            .govuk-list--number {
              padding-left: 20px;
              list-style-type: decimal;
            }
            
            .govuk-list--bullet > li,
            .govuk-list--number > li {
              margin-bottom: 0;
            }
            
            @media (min-width: 40.0625em) {
              .govuk-list--bullet > li,
              .govuk-list--number > li {
                margin-bottom: 5px;
              }
            }
            
            .govuk-list--spaced > li {
              margin-bottom: 10px;
            }
            
            @media (min-width: 40.0625em) {
              .govuk-list--spaced > li {
                margin-bottom: 15px;
              }
            }
            
            .govuk-template {
              background-color: #f3f2f1;
              -webkit-text-size-adjust: 100%;
              -ms-text-size-adjust: 100%;
              text-size-adjust: 100%;
            }
            
            @media screen {
              .govuk-template {
                overflow-y: scroll;
              }
            }
            
            .govuk-template__body {
              margin: 0;
              background-color: #ffffff;
            }
            
            .govuk-heading-xl {
              color: #0b0c0c;
              font-family: "GDS Transport", arial, sans-serif;
              -webkit-font-smoothing: antialiased;
              -moz-osx-font-smoothing: grayscal

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

d');</script>
            
            
            <a href="#main-content" class="govuk-skip-link">Skip to main content</a>
            
            
            <header class="govuk-header " role="banner" data-module="govuk-header">
              <div class="govuk-header__container govuk-width-container">
                <div class="govuk-header__logo">
                  <a href="https://www.gov.uk/" class="govuk-header__link govuk-header__link--homepage">
                    <span class="govuk-header__logotype">
                      <img src="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/logo_gov.png" height="30" width="36"
                           class="govuk-header__logotype-crown-fallback-image"/>
                      <span class="govuk-header__logotype-text">
                        GOV.UK
                      </span>
                    </span>
            
                  </a>
                </div>
            
                <div class="govuk-header__content">
            
                  <a href="https://pip-frontend.staging.platform.hmcts.net/view-option" class="govuk-header__link govuk-header__link--service-name">
                    Court and tribunal hearings
                  </a>
            
            
                </div>
            
              </div>
            </header>
            
            
            <div class="govuk-width-container ">
            
            
              <nav class="moj-sub-navigation pub-navigation govuk-!-margin-bottom-0" aria-label="Primary navigation">
            
                <ul class="moj-sub-navigation__list">
                  <li class="moj-sub-navigation__item">
                    <a class="moj-sub-navigation__link" href="https://pip-frontend.staging.platform.hmcts.net/">Home</a>
                </ul>
            
              </nav>
            
            
              <main class="govuk-main-wrapper " id="main-content" role="main">
            
                <link href="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw.css" rel="stylesheet">
                <div id="api">
            
            
                </div>
            
              </main>
            </div>
            
            
            <footer class="govuk-footer " role="contentinfo">
              <div class="govuk-width-container ">
            
                <div class="govuk-footer__meta">
                  <div class="govuk-footer__meta-item govuk-footer__meta-item--grow">
            
                    <h2 class="govuk-visually-hidden">Support links</h2>
            
                    <ul class="govuk-footer__inline-list">
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://gov.uk/help">
                          Help
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://gov.uk/help/privacy-notice">
                          Privacy
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://pip-frontend.staging.platform.hmcts.net/Cookie-policy">
                          Cookies
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://pip-frontend.staging.platform.hmcts.net/accessibility-statement">
                          Accessibility statement
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://gov.uk/contact">
                          Contact
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://www.gov.uk/help/terms-conditions">
                          Terms and conditions
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://www.gov.uk/cymraeg">
                          Welsh
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://www.gov.uk/government/organisations/government-digital-service">
                          Government Digital Service
                        </a>
                      </li>
                    </ul>
            
                    <img src="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/copyright.png" height="17" width="41"
                         class="govuk-footer__licence-logo"/>
                    <span class="govuk-footer__licence-description">
                      All content is available under the
                      <a class="govuk-footer__link"
                         href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/" rel="license">Open Government Licence v3.0</a>, except where otherwise stated
                    </span>
                    <p class="govuk-footer__licence-description">When you use this information under the OGL,
                      you should include the following attribution: Contains public sector information licensed under the
                      <a class="govuk-footer__link"
                         href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/"
                         rel="license">Open Government Licence v3.0</a>
                    </p>
                    <p class="govuk-footer__licence-description govuk-!-margin-0">The
                      <a class="govuk-footer__link"
                         href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/"
                         rel="license">Open Government Licence v3.0</a> does not cover use of any personal data in the
                         court and tribunal hearings service. Personal data is subject to applicable data protection laws.
                    </p>
                  </div>
                  <div class="govuk-footer__meta-item">
                    <a class="govuk-footer__link govuk-footer__copyright-logo"
                       href="https://www.nationalarchives.gov.uk/information-management/re-using-public-sector-information/uk-government-licensing-framework/crown-copyright/">©
                      Crown copyright</a>
                  </div>
                </div>
              </div>
            </footer>
            
          + <script>
          +   function setPasswordAdvice() {
          +     const passwordLabel = document.getElementById('newPassword_label');
          + 
          +     if (passwordLabel) {
          +       const passwordAdvice = document.createElement('p');
          +       const text = document.createTextNode('Your password must be 8-16 characters in length and contain 3 out of the 4 following: a lowercase character, uppercase character, a digit (0-9) or one or more of the following symbols @ # $ % ^ & * - _ + = [ ] { } | \\ : \' , ? / ` ~ " ( ) ; .');
          +       passwordAdvice.appendChild(text);
          + 
          +       const div = document.createElement('div');
          +       div.className = 'passwordAdvice';
          +       div.appendChild(passwordAdvice);
          + 
          +       passwordLabel.parentNode.insertBefore(div, passwordLabel.nextSibling)
          +     }
          +   }
          + 
          +   function replaceHeadingWithH2() {
          +     const replacementHeading = document.createElement('h2');
          +     const text = document.createTextNode('Please provide the following details.');
          +     replacementHeading.appendChild(text);
          + 
          +     const heading = document.querySelector('.intro');
          +     heading.innerHTML = '';
          +     heading.appendChild(replacementHeading);
          +   }
          + 
          +   setPasswordAdvice();
          +   replaceHeadingWithH2();
          + </script>
          + 
            </body>
            </html>
        EOT
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw.html" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.apim_product[0].azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/pip-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_job_schedule.client_serects must be replaced
-/+ resource "azurerm_automation_job_schedule" "client_serects" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/jobSchedules/2373bae0-0d4e-491c-a59a-8d66741125c3" -> (known after apply)
      ~ job_schedule_id         = "2373bae0-0d4e-491c-a59a-8d66741125c3" -> (known after apply)
      ~ parameters              = {
          - "application_id_collection" = "230bec9c-3991-4499-abe3-e58276a7dd99,c3c0f9b5-dfad-4d2b-8f20-4164db16900e"
          - "environment"               = "stg"
          - "key_vault_name"            = "pip-ss-kv-stg"
          - "prefix"                    = "auto"
          - "product"                   = "pip"
          - "source_client_id"          = "f4e06bc2-c8a5-4643-8ce7-85023024abb8"
          - "source_tenant_id"          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
          - "target_application_id"     = "0a68d82c-3643-4316-a8d8-f770a12ade1e"
          - "target_application_secret" = (sensitive value)
          - "target_tenant_id"          = "676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        } -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_job_schedule.client_serects_trigger_once must be replaced
-/+ resource "azurerm_automation_job_schedule" "client_serects_trigger_once" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/jobSchedules/42be57d7-3667-4817-9f4a-af7e7b385428" -> (known after apply)
      ~ job_schedule_id         = "42be57d7-3667-4817-9f4a-af7e7b385428" -> (known after apply)
      ~ parameters              = {
          - "application_id_collection" = "230bec9c-3991-4499-abe3-e58276a7dd99,c3c0f9b5-dfad-4d2b-8f20-4164db16900e"
          - "environment"               = "stg"
          - "key_vault_name"            = "pip-ss-kv-stg"
          - "prefix"                    = "auto"
          - "product"                   = "pip"
          - "source_client_id"          = "f4e06bc2-c8a5-4643-8ce7-85023024abb8"
          - "source_tenant_id"          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
          - "target_application_id"     = "0a68d82c-3643-4316-a8d8-f770a12ade1e"
          - "target_application_secret" = (sensitive value)
          - "target_tenant_id"          = "676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        } -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule"
        name                    = "rotate-client-secrets-schedule"
      ~ start_time              = "2023-02-11T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects_trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects_trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule-single-trigger"
        name                    = "rotate-client-secrets-schedule-single-trigger"
      ~ start_time              = "2023-02-10T10:40:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.kv.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg|pip-ss-kv-stg"
      + log_analytics_destination_type = "AzureDiagnostics"
        name                           = "pip-ss-kv-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.kv_apim.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-apim-kv-stg|pip-ss-apim-kv-stg"
      + log_analytics_destination_type = "AzureDiagnostics"
        name                           = "pip-ss-apim-kv-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.kv_sdp.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-sdp-kv-stg|pip-ss-sdp-kv-stg"
      + log_analytics_destination_type = "AzureDiagnostics"
        name                           = "pip-ss-sdp-kv-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.redis.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-cache-stg/providers/Microsoft.Cache/Redis/pip-stg"
        name                          = "pip-stg"
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (23 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved = 642 -> 300
          ~ maxmemory_delta                 = 642 -> 200
          ~ maxmemory_reserved              = 642 -> 200
            # (7 unchanged attributes hidden)
        }
    }

  # module.sa.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Storage/storageAccounts/pipsssastg"
        name                              = "pipsssastg"
      ~ tags                              = {
          - "Deployment Environment" = "stg" -> null
          - "Destroy Me"             = "No" -> null
          - "Team Contact"           = "#vh-devops" -> null
            # (7 unchanged elements hidden)
        }
        # (49 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 8 to add, 10 to change, 8 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":88,"Program":"tfcmt","SHA1":"","Vars":{}} -->